# 1-1. 학생 흡연율 데이터 전처리

students_smoke 데이터 셋은 한 도시의 20개 중, 고교를 대상으로 조사한 흡연율 자료이다.  
도시와 농천별에 따른 남여 평균 흡연율을 확인할 수 있는 데이터 피벗테이블을 구성하시오.

In [1]:
from hossam import load_data
from pandas import pivot_table, melt

In [2]:
origin=load_data('students_smoke')
origin

[data] https://data.hossam.kr/data/lab05/students_smoke.xlsx
[desc] 한 도시의 20개 중,고교를 대상으로 조사한 흡연율 자료 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    지역  구성   흡연율
0   도시   남  0.64
1   도시   여  0.45
2   농촌  공학  0.70
3   도시   남  0.85
4   농촌   남  0.72
5   도시   남  0.78
6   도시   여  0.62
7   도시   남  0.79
8   농촌   남  0.75
9   농촌  공학  0.81
10  농촌   여  0.56
11  도시   여  0.48
12  농촌   남  0.72
13  도시  공학  0.68
14  농촌   남  0.79
15  도시   남  0.90
16  농촌   여  0.34
17  도시   여  0.48
18  농촌   여  0.49
19  농촌  공학  0.76

In [3]:
my_pivot=pivot_table(origin, index='지역', columns='구성', values='흡연율', aggfunc='mean')
my_pivot

구성        공학      남         여
지역
농촌  0.756667  0.745  0.463333
도시  0.680000  0.792  0.507500

# 1-2. 동네 아이스크림 가게 매출 분석

icecream_sales 데이터셋을 사용하여 아래의 임무를 수행하여라.

1. 데이터의 전체적인 구조와 정보를 확인하고, 판매 수량에 결측치가 있는지 확인하시오.
    - 만약 결측치가 있다면, 해당 행을 제거하시오.
2. 판매 날짜를 인덱스로, 아이스크림 맛을 컬럼으로 하여 각 맛의 일별 판매량을 보여주는 피벗 테이블을 만드시오.
3. 위에서 만든 피벗 테이블을 다시 긴 형식(Long format)의 데이터로 분리하여라. 컬럼 이름은 원본 이름을 그대로 유지해야 한다.

In [4]:
from hossam import load_data
from pandas import pivot_table, melt

In [5]:
origin=load_data('icecream_sales')
origin.info()
origin.isna().sum()

[data] https://data.hossam.kr/data/lab05/icecream_sales.xlsx
[desc] '달콤 스쿱' 아이스크림 가게의 매출 데이터 (인덱스 없음)

field     description
--------  -------------
Date      판매 날짜
Flavor    아이스크림 맛
Topping   추가된 토핑
Price     개당 가격
Quantity  판매 수량

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      12 non-null     datetime64[ns]
 1   Flavor    12 non-null     object
 2   Topping   11 non-null     object
 3   Price     12 non-null     int64
 4   Quantity  11 non-null     float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 612.0+ bytes

Date        0
Flavor      0
Topping     1
Price       0
Quantity    1
dtype: int64

In [6]:
my_df=origin.dropna(subset=['Quantity'])
my_df

         Date Flavor Topping  Price  Quantity
0  2023-07-01    초콜릿     아몬드   3500      20.0
1  2023-07-01    바닐라    초코시럽   3000      25.0
2  2023-07-01     딸기      연유   3200      18.0
3  2023-07-02   민트초코     초코칩   3800      15.0
4  2023-07-02    초콜릿     아몬드   3500      22.0
5  2023-07-02    바닐라     NaN   3000      30.0
6  2023-07-03     딸기      연유   3200      25.0
8  2023-07-03    바닐라    초코시럽   3000      28.0
9  2023-07-04    초콜릿     아몬드   3500      18.0
10 2023-07-04     딸기      연유   3200      22.0
11 2023-07-04   민트초코     초코칩   3800      17.0

In [7]:
my_pv=pivot_table(my_df,index='Date',columns='Flavor',values='Quantity')
my_pv

Flavor        딸기  민트초코   바닐라   초콜릿
Date
2023-07-01  18.0   NaN  25.0  20.0
2023-07-02   NaN  15.0  30.0  22.0
2023-07-03  25.0   NaN  28.0   NaN
2023-07-04  22.0  17.0   NaN  18.0

In [8]:
my_pv2=my_pv.reset_index()
my_melt=melt(my_pv2, id_vars=['Date'],value_vars=['딸기', '민트초코', '바닐라', '초콜릿'],var_name='Flavor',value_name='Quantity').dropna().reset_index(drop=True)
my_melt

         Date Flavor  Quantity
0  2023-07-01     딸기      18.0
1  2023-07-03     딸기      25.0
2  2023-07-04     딸기      22.0
3  2023-07-02   민트초코      15.0
4  2023-07-04   민트초코      17.0
5  2023-07-01    바닐라      25.0
6  2023-07-02    바닐라      30.0
7  2023-07-03    바닐라      28.0
8  2023-07-01    초콜릿      20.0
9  2023-07-02    초콜릿      22.0
10 2023-07-04    초콜릿      18.0

# 2. 게임 토너먼트 최고 득점자 찾기

game_scores 데이터 셋은 최근 열린 게임 토너먼트 경기 결과 데이터이다.  
데이터는 선수 이름('player')과 각 스테이지('stage1', 'stage2', 'stage3') 점수로 구성되어 있다.  
일부 선수는 특정 스테이지에 참여하지 않아 점수가 비어있을 수 있다.  
모든 스테이지에 참여한 선수들 중에서, 평균 점수가 가장 높은 "최고의 선수"를 찾아내고, 그 선수의 평균 점수를 계산하여라.  

1. 각 스테이지 점수가 열로 구성된 데이터를, 선수와 스테이지 레벨에 따른 점수를 나타내는 형태로 재구조화 하시오.
2. 스테이지에 모두 참여한 선수만을 대상으로 분석하시오. (결측치가 없는 선수)
3. 선수별 평균 점수를 계산하시오.

In [9]:
from hossam import load_data
from pandas import DataFrame

In [10]:
origin=load_data('game_scores')
origin

[data] https://data.hossam.kr/data/lab05/game_scores.xlsx
[desc] 최근 열린 게임 토너먼트 경기 결과 데이터 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    player  stage1  stage2  stage3
0    Alice      85    92.0    88.0
1      Bob      78     NaN    95.0
2  Charlie      90    88.0    91.0
3    David      82    85.0     NaN
4      Eva      95    98.0    99.0

In [11]:
df=origin.set_index('player')
my_st=df.stack(dropna=False)
DataFrame(my_st)

C:\Users\itwill\AppData\Local\Temp\ipykernel_20040\816557702.py:2: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  my_st=df.stack(dropna=False)

                   0
player
Alice   stage1  85.0
        stage2  92.0
        stage3  88.0
Bob     stage1  78.0
        stage2   NaN
        stage3  95.0
Charlie stage1  90.0
        stage2  88.0
        stage3  91.0
David   stage1  82.0
        stage2  85.0
        stage3   NaN
Eva     stage1  95.0
        stage2  98.0
        stage3  99.0

In [12]:
df2=df.dropna()
my_st2=df2.stack()
DataFrame(my_st2)

                   0
player
Alice   stage1  85.0
        stage2  92.0
        stage3  88.0
Charlie stage1  90.0
        stage2  88.0
        stage3  91.0
Eva     stage1  95.0
        stage2  98.0
        stage3  99.0

In [13]:
final_df=df2.mean(axis=1)
DataFrame(final_df)

                 0
player
Alice    88.333333
Charlie  89.666667
Eva      97.333333

# 3. 영업 데이터 분석

데이터셋 online_shop_sales 를 불러와서 아래의 작업을 진행하시오.

1. 각 고객('UserID')별 총 구매 금액(Total)을 계산하시오.
    - 총 구매 금액은 개별 주문의 'Price'와 'Quantity'를 곱한 값들의 총합입니다.
2. 총 구매 금액이 가장 높은 상위 2명의 고객을 찾아, 'UserID'와 '총 구매 금액'을 출력하시오.
3. 최종 결과는 총 구매 금액을 기준으로 내림차순으로 정렬하여 제시하시오.

In [14]:
from hossam import load_data
import numpy as np
from pandas import DataFrame

In [15]:
origin=load_data('online_shop_sales')
origin

[data] https://data.hossam.kr/data/lab05/online_shop_sales.xlsx
[desc] 우수 고객을 찾아라! - 영업 데이터 분석 챌린지

field      description
---------  ----------------
OrderID    주문번호(인덱스)
UserID     고객아이디
Product    상품
Price      가격
Quantity   주문수량
OrderDate  주문일

         UserID          Product  Price  Quantity  OrderDate
OrderID
1          1001           Laptop   1200         1 2024-10-01
2          1002            Mouse     25         2 2024-10-01
3          1001         Keyboard     75         1 2024-10-02
4          1003          Monitor    300         1 2024-10-03
5          1002           Webcam     50         1 2024-10-04
6          1003       HDMI Cable     15         3 2024-10-05
7          1001          USB Hub     30         2 2024-10-06
8          1004           Laptop   1300         1 2024-10-07
9          1002            Mouse     25         1 2024-10-08
10         1003          Monitor    300         2 2024-10-09
11         1001     External SSD    150         1 2024-10-10
12         1004  Docking Station    250         1 2024-10-11
13         1002         Keyboard     80         1 2024-10-12
14         1003           Webcam     55         1 2024-10-13
15         1001            Mouse     28         1 2024-10-14

In [16]:
origin['Total']=origin['Price']*origin['Quantity']
df=origin.filter(['UserID','Total']).groupby('UserID').sum()
df

        Total
UserID
1001     1513
1002      205
1003     1000
1004     1550

In [17]:
df1=df.sort_values(['Total'],ascending=False).head(2)
df1

        Total
UserID
1004     1550
1001     1513

# 4. 온라인 스토어 고객 행동 분석

- 주어지는 데이터 셋
    - online_store_customers : 고객의 기본 인구 통계 정보 (고객ID, 성별, 나이, 거주 도시, 멤버십 등급)
    - online_store_purchases : 고객의 구매 관련 정보 (고객ID, 마지막 구매일, 총 소비 금액, 이탈 여부)

1. 두 데이터를 불러와서 고객ID를 기준으로 병합하시오.
2. 구매 데이터의 'size' 열에 존재하는 결측치는 가장 빈도가 높은 사이즈로 채우시오.
3. 성별에 따른 구매 패턴을 분석하기 위해 'gender' 열에 대해 더미변수를 생성하시오.
4. 색상 선호도를 분석하기 위해 'color' 열을 One-Hot Encoding 방식으로 변환하여 새로운 열들을 추가하시오.

In [18]:
from hossam import load_data
import numpy as np
from pandas import DataFrame, merge, get_dummies
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from pandas import CategoricalDtype

In [19]:
c_df=load_data('online_store_customers')
p_df=load_data('online_store_purchases')

[data] https://data.hossam.kr/data/lab05/online_store_customers.xlsx
[desc] 한 온라인 스토어의 마케팅 팀이 연말 특별 프로모션을 기획에 필요한 고객의 기본 인구 통계 정보(메타데이터 없음)
[!] Cannot read metadata
[data] https://data.hossam.kr/data/lab05/online_store_purchases.xlsx
[desc] 한 온라인 스토어의 마케팅 팀이 연말 특별 프로모션을 기획에 필요한 고객의 구매 관련 정보(메타데이터 없음)
[!] Cannot read metadata

In [20]:
c_df

            name gender  age
user_id
1          Alice      F   25
2            Bob      M   30
3        Charlie      M   35
4          David      M   42
5            Eve      F   28
6          Frank      M   21
7          Grace      F   33
8          Henry      M   45
9            Ivy      F   29
10          Jack      M   38

In [21]:
p_df

             user_id  product size  color  price
purchase_id
101                1  T-shirt    M  White  15000
102                2    Pants    L  Black  35000
103                1    Skirt    S    Red  25000
104                3  T-shirt    L   Blue  17000
105                5   Jacket    M  Black  55000
106                4    Pants    M  Khaki  33000
107                6  T-shirt    S  White  16000
108                7   Jacket  NaN    Red  58000
109                8    Pants    L  Black  38000
110                9    Skirt    S   Blue  27000
111               10  T-shirt   XL  White  18000
112                5    Pants    S  Khaki  32000
113                2   Jacket    L   Navy  62000
114                7  T-shirt    M  Black  19000
115                1    Pants    S   Blue  31000

In [22]:
df=merge(c_df,p_df,left_index=True,right_on=['user_id'])
my_df=df.astype({'name':'category','gender':'category','user_id':'category','product':'category','size':'category','color':'category'})
my_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15 entries, 101 to 111
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     15 non-null     category
 1   gender   15 non-null     category
 2   age      15 non-null     int64
 3   user_id  15 non-null     category
 4   product  15 non-null     category
 5   size     14 non-null     category
 6   color    15 non-null     category
 7   price    15 non-null     int64
dtypes: category(6), int64(2)
memory usage: 1.9 KB

In [23]:
imr=SimpleImputer(missing_values=np.nan, strategy='most_frequent')
imr_value=imr.fit_transform(my_df[['size']])
imr_df=DataFrame(imr_value,index=my_df.index,columns=['size'])
hello_df=my_df.copy()
hello_df['size']=imr_df['size']
hello_df

# 아래는 나의 코드
# imr=SimpleImputer(missing_values=np.nan, strategy='most_frequent')
# df_reshape=my_df['size'].values.reshape(-1,1)
# df_imr=imr.fit_transform(df_reshape)
# hello_df=my_df.copy()
# hello_df['size']=df_imr.ravel()
# hello_df

                name gender  age user_id  product size  color  price
purchase_id
101            Alice      F   25       1  T-shirt    M  White  15000
103            Alice      F   25       1    Skirt    S    Red  25000
115            Alice      F   25       1    Pants    S   Blue  31000
102              Bob      M   30       2    Pants    L  Black  35000
113              Bob      M   30       2   Jacket    L   Navy  62000
104          Charlie      M   35       3  T-shirt    L   Blue  17000
106            David      M   42       4    Pants    M  Khaki  33000
105              Eve      F   28       5   Jacket    M  Black  55000
112              Eve      F   28       5    Pants    S  Khaki  32000
107            Frank      M   21       6  T-shirt    S  White  16000
108            Grace      F   33       7   Jacket    S    Red  58000
114            Grace      F   33       7  T-shirt    M  Black  19000
109            Henry      M   45       8    Pants    L  Black  38000
110              Ivy      F   29       9    Skirt    S   Blue  27000
111             Jack      M   38      10  T-shirt   XL  White  18000

In [24]:
dummy_df=get_dummies(hello_df,columns=['gender'],dtype='int',drop_first=True)
dummy_df

                name  age user_id  product size  color  price  gender_M
purchase_id
101            Alice   25       1  T-shirt    M  White  15000         0
103            Alice   25       1    Skirt    S    Red  25000         0
115            Alice   25       1    Pants    S   Blue  31000         0
102              Bob   30       2    Pants    L  Black  35000         1
113              Bob   30       2   Jacket    L   Navy  62000         1
104          Charlie   35       3  T-shirt    L   Blue  17000         1
106            David   42       4    Pants    M  Khaki  33000         1
105              Eve   28       5   Jacket    M  Black  55000         0
112              Eve   28       5    Pants    S  Khaki  32000         0
107            Frank   21       6  T-shirt    S  White  16000         1
108            Grace   33       7   Jacket    S    Red  58000         0
114            Grace   33       7  T-shirt    M  Black  19000         0
109            Henry   45       8    Pants    L  Black  38000         1
110              Ivy   29       9    Skirt    S   Blue  27000         0
111             Jack   38      10  T-shirt   XL  White  18000         1

In [25]:
X=dummy_df[['color']]
X.head()

             color
purchase_id
101          White
103            Red
115           Blue
102          Black
113           Navy

In [26]:
encoder=OneHotEncoder(sparse_output=False,drop=None)
result=encoder.fit_transform(X)
result

array([[0., 0., 0., 0., 0., 1.],
       [0., 0., 0., 0., 1., 0.],
       [0., 1., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1.],
       [0., 0., 0., 0., 1., 0.],
       [1., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1.]])

In [27]:
new_cols=encoder.get_feature_names_out(['color'])
new_cols

array(['color_Black', 'color_Blue', 'color_Khaki', 'color_Navy',
       'color_Red', 'color_White'], dtype=object)

In [28]:
one_hot_df=DataFrame(result,columns=new_cols,index=df.index)
one_hot_df.head()

,color_Black,color_Blue,color_Khaki,color_Navy,color_Red,color_White
purchase_id,,,,,,
101,0.0,0.0,0.0,0.0,0.0,1.0
103,0.0,0.0,0.0,0.0,1.0,0.0
115,0.0,1.0,0.0,0.0,0.0,0.0
102,1.0,0.0,0.0,0.0,0.0,0.0
113,0.0,0.0,0.0,1.0,0.0,0.0

In [29]:
df_copy=dummy_df.copy()
final_df=merge(dummy_df,one_hot_df,left_index=True,right_index=True)
final_df.drop(columns='color',inplace=True)
final_df

,name,age,user_id,product,size,price,gender_M,color_Black,color_Blue,color_Khaki,color_Navy,color_Red,color_White
purchase_id,,,,,,,,,,,,,
101,Alice,25,1,T-shirt,M,15000,0,0.0,0.0,0.0,0.0,0.0,1.0
103,Alice,25,1,Skirt,S,25000,0,0.0,0.0,0.0,0.0,1.0,0.0
115,Alice,25,1,Pants,S,31000,0,0.0,1.0,0.0,0.0,0.0,0.0
102,Bob,30,2,Pants,L,35000,1,1.0,0.0,0.0,0.0,0.0,0.0
113,Bob,30,2,Jacket,L,62000,1,0.0,0.0,0.0,1.0,0.0,0.0
104,Charlie,35,3,T-shirt,L,17000,1,0.0,1.0,0.0,0.0,0.0,0.0
106,David,42,4,Pants,M,33000,1,0.0,0.0,1.0,0.0,0.0,0.0
105,Eve,28,5,Jacket,M,55000,0,1.0,0.0,0.0,0.0,0.0,0.0
112,Eve,28,5,Pants,S,32000,0,0.0,0.0,1.0,0.0,0.0,0.0
107,Frank,21,6,T-shirt,S,16000,1,0.0,0.0,0.0,0.0,0.0,1.0
108,Grace,33,7,Jacket,S,58000,0,0.0,0.0,0.0,0.0,1.0,0.0
114,Grace,33,7,T-shirt,M,19000,0,1.0,0.0,0.0,0.0,0.0,0.0
109,Henry,45,8,Pants,L,38000,1,1.0,0.0,0.0,0.0,0.0,0.0
110,Ivy,29,9,Skirt,S,27000,0,0.0,1.0,0.0,0.0,0.0,0.0
111,Jack,38,10,T-shirt,XL,18000,1,0.0,0.0,0.0,0.0,0.0,1.0

# 5. 직원 성과 분석을 위한 데이터 스케일링

'performance' 데이터 셋에 대해 다음 스케일링 기법들을 각 컬럼에 적용하시오.

1. 'MonthlySales' 컬럼에는 Min-Max 스케일링을 적용하여 0과 1 사이의 값으로 변환하시오.
2. 'CustomerSatisfaction' 컬럼에는 MaxAbs 스케일링을 적용하여 -1과 1 사이의 값으로 변환하시오.
3. 'ProjectHours'와 'InnovationScore' 컬럼에는 Standard 스케일링(표준화)을 적용하여 평균이 0, 표준편차가 1인 값으로 변환하시오.
4. 모든 스케일링 과정이 끝난 후, 'MonthlySales'(Min-Max 스케일링), 'CustomerSatisfaction'(MaxAbs 스케일링), 'ProjectHours'(Standard 스케일링), 'InnovationScore'(Standard 스케일링) 컬럼의 값을 모두 더했을 때, 합산 값이 가장 높은 직원의 'EmployeeID'를 찾아보시오.

In [30]:
from hossam import load_data
import numpy as np
from sklearn.preprocessing import MinMaxScaler, MaxAbsScaler, StandardScaler
from pandas import DataFrame

In [31]:
origin=load_data('performance')
origin

[data] https://data.hossam.kr/data/lab05/performance.xlsx
[desc] 직원 성과 지표 데이터

field                 description
--------------------  -----------------
EmployeeID            직원 ID
MonthlySales          월별 매출
CustomerSatisfaction  고객 만족도
ProjectHours          프로젝트 작업시간
InnovationScore       혁신 점수

            MonthlySales  CustomerSatisfaction  ProjectHours  InnovationScore
EmployeeID
E001                 120                    75           160                8
E002                 250                    90           180                9
E003                  80                    60           150                6
E004                 180                    82           170                8
E005                 300                    95           190               10
E006                  90                    65           155                7
E007                 200                    88           175                9
E008                 110                    70           165                7
E009                 220                    85           185                9
E010                  70                    55           145                6
E011                 130                    78           162                8
E012                 280                    92           188               10
E013                  60                    50           140                5
E014                 190                    80           172                8
E015                 260                    91           183                9
E016                 100                    68           158                7
E017                 170                    83           168                8
E018                 320                    98           195               10
E019                  50                    45           135                5
E020                 240                    89           178                9

In [32]:
x=origin[['MonthlySales']]
scaler=MinMaxScaler()
origin['MonthlySales_MinMax']=scaler.fit_transform(x)
origin.head()

,MonthlySales,CustomerSatisfaction,ProjectHours,InnovationScore,MonthlySales_MinMax
EmployeeID,,,,,
E001,120,75,160,8,0.259259
E002,250,90,180,9,0.740741
E003,80,60,150,6,0.111111
E004,180,82,170,8,0.481481
E005,300,95,190,10,0.925926

In [33]:
y=origin[['CustomerSatisfaction']]
scaler=MaxAbsScaler()
origin['CustomerSatisfaction_MaxAbs']=scaler.fit_transform(y)
origin.head()

,MonthlySales,CustomerSatisfaction,ProjectHours,InnovationScore,MonthlySales_MinMax,CustomerSatisfaction_MaxAbs
EmployeeID,,,,,,
E001,120,75,160,8,0.259259,0.765306
E002,250,90,180,9,0.740741,0.918367
E003,80,60,150,6,0.111111,0.612245
E004,180,82,170,8,0.481481,0.836735
E005,300,95,190,10,0.925926,0.969388

In [34]:
z=origin[['ProjectHours']]
scaler=StandardScaler()
origin['ProjectHours_Standard']=scaler.fit_transform(z)
origin.head()

,MonthlySales,CustomerSatisfaction,ProjectHours,InnovationScore,MonthlySales_MinMax,CustomerSatisfaction_MaxAbs,ProjectHours_Standard
EmployeeID,,,,,,,
E001,120,75,160,8,0.259259,0.765306,-0.462556
E002,250,90,180,9,0.740741,0.918367,0.738889
E003,80,60,150,6,0.111111,0.612245,-1.063279
E004,180,82,170,8,0.481481,0.836735,0.138166
E005,300,95,190,10,0.925926,0.969388,1.339611

In [35]:
a=origin[['InnovationScore']]
scaler=StandardScaler()
origin['InnovationScore_Standard']=scaler.fit_transform(a)
origin.head()

,MonthlySales,CustomerSatisfaction,ProjectHours,InnovationScore,MonthlySales_MinMax,CustomerSatisfaction_MaxAbs,ProjectHours_Standard,InnovationScore_Standard
EmployeeID,,,,,,,,
E001,120,75,160,8,0.259259,0.765306,-0.462556,0.066082
E002,250,90,180,9,0.740741,0.918367,0.738889,0.726900
E003,80,60,150,6,0.111111,0.612245,-1.063279,-1.255555
E004,180,82,170,8,0.481481,0.836735,0.138166,0.066082
E005,300,95,190,10,0.925926,0.969388,1.339611,1.387719

In [36]:
origin['Score']=origin['MonthlySales_MinMax']+origin['CustomerSatisfaction_MaxAbs']+origin['ProjectHours_Standard']+origin['InnovationScore_Standard']
origin.head()

,MonthlySales,CustomerSatisfaction,ProjectHours,InnovationScore,MonthlySales_MinMax,CustomerSatisfaction_MaxAbs,ProjectHours_Standard,InnovationScore_Standard,Score
EmployeeID,,,,,,,,,
E001,120,75,160,8,0.259259,0.765306,-0.462556,0.066082,0.628091
E002,250,90,180,9,0.740741,0.918367,0.738889,0.726900,3.124897
E003,80,60,150,6,0.111111,0.612245,-1.063279,-1.255555,-1.595478
E004,180,82,170,8,0.481481,0.836735,0.138166,0.066082,1.522464
E005,300,95,190,10,0.925926,0.969388,1.339611,1.387719,4.622644

In [37]:
final_df=origin.sort_values(['Score'], ascending=False)
final_df.head(1).index[0]

'E018'